<a href="https://colab.research.google.com/github/jessamcs/jessamcs_dojo/blob/main/Recreate.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# mount data
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
# import libraries
import matplotlib.pyplot as plt
import pandas as pd

In [ ]:
# load the dataset
df = pd.read_csv('/content/drive/MyDrive/mortgages.csv')
df.head()

   Month  Starting Balance  Repayment  ...  New Balance  Mortgage Name  Interest Rate
0      1         400000.00    1686.42  ...    399313.58        30 Year           0.03
1      2         399313.58    1686.42  ...    398625.44        30 Year           0.03
2      3         398625.44    1686.42  ...    397935.58        30 Year           0.03
3      4         397935.58    1686.42  ...    397243.99        30 Year           0.03
4      5         397243.99    1686.42  ...    396550.67        30 Year           0.03

[5 rows x 8 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1080 entries, 0 to 1079
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Month             1080 non-null   int64
 1   Starting Balance  1080 non-null   float64
 2   Repayment         1080 non-null   float64
 3   Interest Paid     1080 non-null   float64
 4   Principal Paid    1080 non-null   float64
 5   New Balance       1080 non-null   float64
 6   Mortgage Name     1080 non-null   object
 7   Interest Rate     1080 non-null   float64
dtypes: float64(6), int64(1), object(1)
memory usage: 67.6+ KB

In [ ]:
# determine possible values and count
df['Mortgage Name'].value_counts()

30 Year    720
15 Year    360
Name: Mortgage Name, dtype: int64

In [ ]:
# filter data
year_30 = df[df['Mortgage Name'] == '30 Year']

     Month  Starting Balance  ...  Mortgage Name  Interest Rate
0        1         400000.00  ...        30 Year           0.03
1        2         399313.58  ...        30 Year           0.03
2        3         398625.44  ...        30 Year           0.03
3        4         397935.58  ...        30 Year           0.03
4        5         397243.99  ...        30 Year           0.03
..     ...               ...  ...            ...            ...
715    356          10596.54  ...        30 Year           0.05
716    357           8493.40  ...        30 Year           0.05
717    358           6381.49  ...        30 Year           0.05
718    359           4260.78  ...        30 Year           0.05
719    360           2131.24  ...        30 Year           0.05

[720 rows x 8 columns]